config.org
* Preamble

#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Benjamin Dyer"
      user-mail-address "dyerbm@mcmaster.ca")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-one)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t
      projectile-project-search-path '("~/Documents")
      )


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.


(let ((default-directory (expand-file-name "packages" doom-private-dir)))
  (normal-top-level-add-subdirs-to-load-path))

(add-to-list 'exec-path "/usr/local/texlive/2021/bin/x86_64-linux")
(add-to-list 'exec-path "/usr/local/texlive/2021/texmf-dist/tex/")

(setq doom-localleader-key ";")
#+END_SRC

* Language Parsers
** Tree Sitter
#+begin_src emacs-lisp
(use-package! tree-sitter
  :config
  (require 'tree-sitter-langs)
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))
#+end_src

* View

#+begin_src emacs-lisp
(setq display-line-numbers-type 'nil)
#+end_src

* Org

#+BEGIN_SRC emacs-lisp
(require 'org)

(setq org-startup-folded t)
(add-hook 'org-mode-hook 'org-hide-block-all) ;;Start blocks collapsed
(define-key org-mode-map (kbd "C-c t") 'org-toggle-block)
#+END_SRC

** Latex in Org

#+BEGIN_SRC emacs-lisp
(setq org-preview-latex-default-process 'dvipng)
(setq org-latex-packages-alist '(("" "physics" t)))
(setq org-latex-packages-alist '(("" "siunitx" t)))

;; auto compile latex fragments
(use-package! org-fragtog)
(add-hook 'org-mode-hook 'org-fragtog-mode)

;; latex processing
(setq org-latex-pdf-process
      '("pdflatex -interaction nonstopmode -output-directory %o %f"
        "bibtex %b"
        "pdflatex -interaction nonstopmode -output-directory %o %f"
        "pdflatex -interaction nonstopmode -output-directory %o %f")) ;check what this does

(setq bibtex-dialect 'BibTeX)
(add-hook 'org-mode-hook #'turn-on-org-cdlatex)
(setq company-global-modes '(not org-mode)) ;disable company mode in org
#+END_SRC

** Org-agenda
#+BEGIN_SRC emacs-lisp
(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)
(setq org-modules '(org-habit))

(use-package! org-super-agenda
  :after org-agenda
  :init
  (setq org-super-agenda-groups '((:name "Today"
                                   :time-grid t
                                   :scheduled today)
                                  (:name "Due today"
                                   :deadline today)
                                  (:name "Important"
                                   :priority "A")
                                  (:name "Overdue"
                                   :deadline past)
                                  (:name "Due soon"
                                   :deadline future
                                   :time-grid t)
                                  (:name "Goals"
                                   :scheduled future)
                                  (:name "Big Outcomes"
                                   :tag "bo")))
  :config
  (org-super-agenda-mode)
  (setq org-super-agenda-header-map nil)
  (setq org-deadline-warning-days 7)
  (setq org-agenda-block-separator 9472)
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-start-on-weekday nil)
  (setq org-agenda-start-day "-1d")
  (setq org-agenda-span 7)
  (setq org-habit-graph-column 80)
  (setq org-habit-show-habits-only-for-today nil)
  )

(eval-after-load 'org
  '(org-load-modules-maybe t))

(setq org-agenda-files (list "~/Documents/Org/SchoolTasks.org"))
;;(advice-add 'org-todo :after 'org-save-all-org-buffers) ;;autosave org-buffers when changing todo's in the agenda
(add-hook 'org-trigger-hook 'save-buffer)
;(advice-add 'org-habit-parse-todo :after 'org-save-all-org-buffers)
#+END_SRC

** Org-Bullets

Gimme dem bullets

#+BEGIN_SRC emacs-lisp
(require 'org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
#+END_SRC

** Org-ref

#+BEGIN_SRC emacs-lisp

(define-key global-map "\C-cl" 'org-store-link)
(setq org-log-done t)

(use-package org-ref
  :ensure t
  :init
  (with-eval-after-load 'ox
    (defun my/org-ref-process-buffer--html (backend)
      "Preprocess `org-ref' citations to HTML format.

Do this only if the export backend is `html' or a derivative of
that."
      ;; `ox-hugo' is derived indirectly from `ox-html'.
      ;; ox-hugo <- ox-blackfriday <- ox-md <- ox-html
      (when (org-export-derived-backend-p backend 'html)
        (org-ref-process-buffer 'html)))
    (add-to-list 'org-export-before-parsing-hook #'my/org-ref-process-buffer--html)))

(setq reftex-default-bibliography '("~/Documents/bibliography/references.bib"))

(setq org-ref-bibliography-notes "~/Documents/bibliography/notes.org"
      org-ref-default-bibliography '("~/Documents/bibliography/references.bib")
      org-ref-pdf-directory "~/Documents/bibliography/pdfs")

(setq bibtex-completion-bibliography "~/Documents/bibliography/references.bib"
      bibtex-completion-library-path "~/Documents/bibliography/pdfs/"
      bibtex-completion-notes-path "~/Documents/bibliography/notes.org"
      bibtex-completion-notes-template-multiple-files "* ${author-or-editor}, ${title}, ${journal}, (${year}) :${=type=}: \n\nSee [[cite:&${=key=}]]\n"

	bibtex-completion-additional-search-fields '(keywords)
	bibtex-completion-display-formats
	'((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
	  (inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
	  (incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	  (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	  (t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}"))
	bibtex-completion-pdf-open-function
	(lambda (fpath)
	  (call-process "open" nil 0 nil fpath)))


(require 'bibtex)

(setq bibtex-autokey-year-length 4
	bibtex-autokey-name-year-separator "-"
	bibtex-autokey-year-title-separator "-"
	bibtex-autokey-titleword-separator "-"
	bibtex-autokey-titlewords 2
	bibtex-autokey-titlewords-stretch 1
	bibtex-autokey-titleword-length 5
	org-ref-bibtex-hydra-key-binding (kbd "H-b"))

(define-key bibtex-mode-map (kbd "H-b") 'org-ref-bibtex-hydra/body)

;; User org-ref-ivy
(require 'org-ref-ivy)

(setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
      org-ref-insert-cite-function 'org-ref-cite-insert-ivy
      org-ref-insert-label-function 'org-ref-insert-label-link
      org-ref-insert-ref-function 'org-ref-insert-ref-link
      org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body)))

(define-key org-mode-map (kbd "C-c ]") 'org-ref-insert-link) ;; need to be able to use this after all



#+END_SRC
10.1109/icma49215.2020.9233826
Here is some stuff to modify how pdfs are downloaded and opened. Currently not included as it throws some errors
10.1109/SysCon48628.2021.944713
10.1109/ICRAS49812.2020.9134921
#+Begin_SRC elisp :tangle no
;(setq bibtex-completion-pdfopen-function 'pdf-tools)
(setq doi-utils-async-download nil)


(setq doi-utils-open-pdf-after-download 't)

(defun my/org-ref-open-pdf-at-point ()
  "Open the pdf for bibtex key under point if it exists."
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
         (key (car results)))
    (funcall bibtex-completion-pdf-open-function (car (bibtex-completion-find-pdf key)))))

(setq org-ref-open-pdf-function #'my/org-ref-open-pdf-at-point)

;; Allow for pulling pdfs from sci-hub
;; Thanks to user Ajned on the emacs stack exchange
;; Sci-hub function
(defun sci-hub-pdf-url (doi)
  "Get url to the pdf from SCI-HUB"
  (setq *doi-utils-pdf-url* (concat "https://sci-hub.se/" doi) ;captcha
        ,*doi-utils-waiting* t
        )
  ;; try to find PDF url (if it exists)
  (url-retrieve (concat "https://sci-hub.se/" doi)
            (lambda (status)
              (goto-char (point-min))
              (while (search-forward-regexp "\\(https://\\|//sci-hub.se/downloads\\).+download=true'" nil t)
                (let ((foundurl (match-string 0)))
                  (message foundurl)
                  (if (string-match "https:" foundurl)
                  (setq *doi-utils-pdf-url* foundurl)
                (setq *doi-utils-pdf-url* (concat "https:" foundurl))))
                (setq *doi-utils-waiting* nil))))
 ; (while *doi-utils-waiting* (sleep-for 0.1))
  ,*doi-utils-pdf-url*)

;; add to the doi-utils-pdf-url-functions
;;(add-to-list 'doi-utils-pdf-url-functions 'sci-hub-pdf-url)

;; Update doi function to use the sci-hub-pdf-url function
(defun doi-utils-get-bibtex-entry-pdf (&optional arg)
    "Download pdf for entry at point if the pdf does not already exist locally.
The entry must have a doi. The pdf will be saved to
`org-ref-pdf-directory', by the name %s.pdf where %s is the
bibtex label.  Files will not be overwritten.  The pdf will be
checked to make sure it is a pdf, and not some html failure
page. You must have permission to access the pdf. We open the pdf
at the end if `doi-utils-open-pdf-after-download' is non-nil.

With one prefix ARG, directly get the pdf from a file (through
`read-file-name') instead of looking up a DOI. With a double
prefix ARG, directly get the pdf from an open buffer (through
`read-buffer-to-switch') instead. These two alternative methods
work even if the entry has no DOI, and the pdf file is not
checked."
    (interactive "P")
    (save-excursion
      (bibtex-beginning-of-entry)
      (let ( ;; get doi, removing http://dx.doi.org/ if it is there.
        (doi (replace-regexp-in-string
          "https?://\\(dx.\\)?.doi.org/" ""
          (bibtex-autokey-get-field "doi")))
        (key (cdr (assoc "=key=" (bibtex-parse-entry))))
        (pdf-url)
        (pdf-file))
    (setq pdf-file (concat
            (if org-ref-pdf-directory
                (file-name-as-directory org-ref-pdf-directory)
              (read-directory-name "PDF directory: " "."))
            key ".pdf"))
    ;; now get file if needed.
    (unless (file-exists-p pdf-file)
      (cond
       ((and (not arg)
        (message "here")
          doi
          (if (doi-utils-get-pdf-url doi)
             ;(setq pdf-url (sci-hub-pdf-url doi)))
             ;(url-copy-file pdf-url pdf-file)))
             (setq pdf-url (doi-utils-get-pdf-url doi))
             (setq pdf-url "https://www.sciencedirect.com/science/article/")))
        (url-copy-file pdf-url pdf-file)
        ;; now check if we got a pdf
        (if (org-ref-pdf-p pdf-file)
          (message "%s saved" pdf-file)
          (delete-file pdf-file)
          ;; sci-hub fallback option
          (setq pdf-url (sci-hub-pdf-url doi))
          (url-copy-file pdf-url pdf-file)
          ;; now check if we got a pdf
          (if (org-ref-pdf-p pdf-file)
          (message "%s saved" pdf-file)
        (delete-file pdf-file)
        (message "No pdf was downloaded.") ; SH captcha
        (browse-url pdf-url))))
       ;; End of sci-hub fallback option
       ((equal arg '(4))
        (copy-file (expand-file-name (read-file-name "Pdf file: " nil nil t))
               pdf-file))
       ((equal arg '(16))
        (with-current-buffer (read-buffer-to-switch "Pdf buffer: ")
          (write-file pdf-file)))
       (t
        (message "We don't have a recipe for this journal.")))
      (when (and doi-utils-open-pdf-after-download (file-exists-p pdf-file))
        (message "Here")
        (org-open-file pdf-file))))))

(setq doi-utils-open-pdf-after-download t) ;always open the pdf after downloading
(setq doi-utils-make-notes t) ;auto generate notes


#+END_SRC

** Image insertion
We use this for =M-x org-download-clipboard= which allows to directly insert an image stored in the clipboard into the current org doc.

Make sure that you have =xclip= installed. I also use =gnome-screenshot= for easy screenshot capture. Take a screenshot (saved into clipboard) and then execute the =M-x org-download-clipboard= command while in an org buffer to insert clipboard image at point. Default config saves the image in the same directory as the org buffer.

#+begin_src emacs-lisp
(require 'org-download)
(setq-default org-download-image-dir "./.autofigs/")
(add-hook 'dired-mode-hook 'org-download-enable) ;Drag-and-drop to dired
#+end_src

** Code in Org

*** Tangle key bind

#+begin_src emacs-lisp
(map! :leader
      :desc "Tangle-all"
      "c T" #'org-babel-tangle)
#+end_src

*** Org-special-edit

Open org-special-edit in the same window as it was called from.
#+begin_src emacs-lisp
(add-to-list 'display-buffer-alist '("^\\*Org Src"
                                     (display-buffer-same-window)
                                     (display-buffer-reuse-window)
                                     (window-parameters
                                      (ttl)
                                      (quit)
                                      (select . t)
                                      (modeline . t)
                                      (autosave . t)
                                      (transient . t)
                                      (no-other-window . t))))
#+end_src

* PDF-Tools

#+BEGIN_SRC emacs-lisp
(use-package! pdf-tools
  :config
  (evil-define-key 'normal pdf-view-mode-map (kbd ":") 'pdf-view-goto-page)
  (map! :localleader
        :map pdf-view-mode-map
          "f" #'pdf-occur
          ;; History
          "c" #'pdf-history-clear
          "j" #'pdf-history-backward
          "k" #'pdf-history-forward

          "o" #'pdf-outline))

(add-hook! 'pdf-view-mode-hook
           (pdf-view-midnight-minor-mode))

#+END_SRC

* Buffer Switching

#+BEGIN_SRC emacs-lisp
(use-package! ace-window
  :config
  (map! :leader
        "k" nil
        :desc "ace-window" "k" #'ace-window)
  (setq aw-scope 'global
        aw-ignore-on nil ; allow ace to jump to any buffer
        ))

(map! :leader
      (:desc "next buffer" "D" #'switch-to-next-buffer
        :desc "prev buffer" "d" #'switch-to-prev-buffer
        )
      (:prefix "s"
        :desc "swiper-isearch-thing-at-point" "t" #'swiper-isearch-thing-at-point)
        ;; :desc "helm-projectile-rg" "p" #'helm-projectile-rg)
      (:desc "repeat last command" "." #'repeat))

(use-package! ivy
 :config
 (map! :leader
     "A" #'ivy-switch-buffer
      "a" nil
      (:prefix ("a" . "switch-to-buffer")
       :desc "c"   "c"  #'(lambda () (interactive) (my/ivy-switch-buffer "\(cpp\|c\)"))
       :desc "h"   "h"  #'(lambda () (interactive) (my/ivy-switch-buffer "\(hpp\|h\)"))
       :desc "m"   "m"  #'(lambda () (interactive) (my/ivy-switch-buffer "\(mat\|m\)"))
       :desc "pdf" "f"  #'(lambda () (interactive) (my/ivy-switch-buffer "pdf"))
       :desc "py"  "p"  #'(lambda () (interactive) (my/ivy-switch-buffer "py"))
       :desc "org" "o"  #'(lambda () (interactive) (my/ivy-switch-buffer "org"))
       :desc "el"  "e"  #'(lambda () (interactive) (my/ivy-switch-buffer "el"))
       :desc "bib" "b"  #'(lambda () (interactive)  (my/ivy-switch-buffer "bib")))))

(defun my/ivy-switch-buffer (extension)
  ;; Show available buffers for a given extension
  (interactive)
  (let ((completion-regexp-list (list (concat ".\." extension "$"))))
  (ivy-read "Switch to buffer: " #'internal-complete-buffer
            :keymap ivy-switch-buffer-map
            :preselect (buffer-name (other-buffer (current-buffer)))
            :action #'ivy--switch-buffer-action
            :matcher #'ivy--switch-buffer-matcher
            :caller 'ivy-switch-buffer)))

(defun my/switch-to-next-buffer-with-same-extension ()
  (interactive)
(save-match-data ; is usually a good idea
  (string-match "\..$" (buffer-name))))

#+END_SRC

* Maximize window

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix "w"
       :desc "maximize window" "f" #'my/toggle-maximize-buffer
       :desc "make new frame"  "n" #'make-frame))

(defun my/toggle-maximize-buffer () "Maximize buffer"
  (interactive)
  (if (= 1 (length (window-list)))
      (jump-to-register '_)
    (progn
      (window-configuration-to-register '_)
      (delete-other-windows))))
#+END_SRC

* MAGIT

#+BEGIN_SRC emacs-lisp
(use-package! magit
  :config
  (map! :leader
        (:prefix "g"
         :desc "status" "G" #'my/magit-status
         :desc "buffer-lock" "T" #'magit-toggle-buffer-lock)))

(defun my/magit-status ()
  "Use ivy to specify directory from which to open a magit status buffer.
Default starting place is the home directory."
  (interactive)
  (let ((default-directory "~/"))
    (ivy-read "git status: " #'read-file-name-internal
              :matcher #'counsel--find-file-matcher
              :action #'(lambda (x)
                          (magit-status x))
              :preselect (counsel--preselect-file)
              :require-match 'confirm-after-completion
              :history 'file-name-history
              :keymap counsel-find-file-map
              :caller 'my/magit-status)))

;don't show the diff on commit, now requires intentionally openning. Should improve performance
(remove-hook 'server-switch-hook 'magit-commit-diff)
#+END_SRC

* DIRED

#+Begin_Src emacs-lisp
(map! :leader
      "x" nil
      (:prefix ("x" . "dired")
       :desc "dired here" "d" #'(lambda () (interactive) (dired default-directory))
       :desc "dired" "D" #'dired))

(setq delete-by-moving-to-trash t) ; Move to trash bin instead of permanently deleting it
#+End_Src

* Todo's
 - [ ] Look for SPC f j
- [ ] Make doi search go to sci-hub first (or delete file and find a new one for invalid <=DOC HEAD)
* Ox-hugo

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'ox
  (require 'ox-hugo))

(use-package! ox-hugo
  :ensure t ;Auto-install the package from Melpa
  :pin melpa ;packages-achrives
  :after ox)
#+END_SRC
